Repository: BajaPaul/EncryptionLocker
Catalog: EncryptionLocker/Strings/*/Resources.resw
Source language: en_us
Languages: es, fr, hi, zh_hans

# UMP_AB_Msg11
source: DISCLAIMER: You assume all risk of using this application. Programmer has done extensive research and testing to validate application works securely and properly. It is your responsibility to test this application using a copy of your data to assure application performs as expected before using any original data. Application does not save your password anywhere. You will not be able to decrypt or access your data if you forget password used to encrypt data.
es: DESCARGO DE RESPONSABILIDAD: Usted asume todos los riesgos de utilizar esta aplicación. El programador ha realizado una extensa investigación y pruebas para validar las aplicaciones de forma segura y adecuada. Es su responsabilidad probar esta aplicación utilizando una copia de sus datos para asegurar que la aplicación se desempeña como se espera antes de usar cualquier dato original. La aplicación no guarda tu contraseña en ningún lugar. No podrá descifrar o acceder a sus datos si olvida la contraseña utilizada para cifrar los datos.
fr: AVERTISSEMENT: Vous assumez tous les risques d'utiliser cette application. Le programmeur a fait des recherches et des tests approfondis pour valider les travaux d'application en toute sécurité et correctement. Il est de votre responsabilité de tester cette application à l'aide d'une copie de vos données pour vous assurer que l'application fonctionne comme prévu avant d'utiliser les données originales. L'application n'enregistre votre mot de passe nulle part. Vous ne pourrez pas déchiffrer ou accéder à vos données si vous oubliez le mot de passe utilisé pour chiffrer les données.
hi: अस्वीकरण: आप इस एप्लिकेशन का उपयोग करने के सभी जोखिम मानते हैं। प्रोग्रामर ने आवेदन कार्यों को सुरक्षित और सही तरीके से सत्यापित करने के लिए व्यापक शोध और परीक्षण किया है। किसी भी मूल डेटा का उपयोग करने से पहले आवेदन निष्पादन सुनिश्चित करने के लिए अपने डेटा की प्रति का उपयोग करके इस एप्लिकेशन का परीक्षण करना आपकी ज़िम्मेदारी है। एप्लिकेशन कहीं भी आपका पासवर्ड सहेजता नहीं है। यदि आप डेटा एन्क्रिप्ट करने के लिए इस्तेमाल पासवर्ड भूल जाते हैं तो आप अपने डेटा को डिक्रिप्ट या एक्सेस नहीं कर पाएंगे।
zh_hans: 声明:您承担使用此应用程序的所有风险。 程序员进行了广泛的研究和测试,以验证应用程序是否安全、正确地工作。 您有责任使用数据副本测试此应用程序,以确保应用程序在使用任何原始数据之前按预期执行。 应用程序不会将您的密码保存到任何位置。 如果您忘记了用于加密数据的密码,您将无法解密或访问您的数据。

# UMP_ToggleDeleteSecure_Msg
source: Default setting for secure delete mode is off. Secure delete mode adds considerable processing time and may not be required. This mode encrypts original item and any temporary items used in process with random password and random initialization vector before deletion. These items cannot be recovered. Windows 10 does not delete content of item on deletion. It only removes item name from database and shows occupied space available. Content of deleted item may still exist on device since Windows 10 uses various caches including Recycle Bin, File History, Hibernation file, Page file, Temp files, and others.
es: La configuración predeterminada para el modo de eliminación segura está desactivada. El modo de borrado seguro agrega un tiempo de procesamiento considerable y puede no ser requerido. Este modo cifra el elemento original y los elementos temporales utilizados en proceso con contraseña aleatoria y vector de inicialización aleatoria antes de la eliminación. Estos artículos no pueden ser recuperados. Windows 10 no elimina el contenido del elemento en la eliminación. Sólo elimina el nombre del elemento de la base de datos y muestra el espacio ocupado disponible. El contenido del elemento eliminado puede seguir existiendo en el dispositivo, ya que Windows 10 utiliza varias cachés que incluyen la papelera de reciclaje, el historial de archivos, el archivo de hibernación, el archivo de página, los archivos temporales y otros.
fr: Le paramètre par défaut pour le mode de suppression sécurisé est éteint. Le mode de suppression sécurisé ajoute un temps de traitement considérable et peut ne pas être nécessaire. Ce mode crypte l'élément d'origine et tous les éléments temporaires utilisés dans le processus avec mot de passe aléatoire et vecteur d'initialisation aléatoire avant la suppression. Ces éléments ne peuvent pas être récupérés. Windows 10 ne supprime pas le contenu de l'élément en suppression. Il supprime uniquement le nom de l'élément de la base de données et affiche l'espace occupé disponible. Le contenu de l'élément supprimé peut toujours exister sur l'appareil puisque Windows 10 utilise divers caches, y compris Recycle Bin, File History, Fichier D'Hibernation, Fichier Page, fichiers Temp, et d'autres.
hi: सुरक्षित हटाने मोड के लिए डिफ़ॉल्ट सेटिंग बंद है। सुरक्षित हटाने मोड काफी प्रसंस्करण समय जोड़ता है और इसकी आवश्यकता नहीं हो सकती है। यह मोड मूल आइटम और किसी भी अस्थायी आइटम को यादृच्छिक पासवर्ड और हटाने से पहले यादृच्छिक प्रारंभिक वेक्टर के साथ प्रक्रिया में उपयोग किया जाता है। इन वस्तुओं को पुनर्प्राप्त नहीं किया जा सकता है। विंडोज 10 हटाने पर आइटम की सामग्री को हटा नहीं देता है। यह केवल डेटाबेस से आइटम नाम हटा देता है और उपलब्ध स्थान पर दिखाता है। हटाए गए आइटम की सामग्री अभी भी डिवाइस पर मौजूद हो सकती है क्योंकि विंडोज 10 रीसायकल बिन, फ़ाइल इतिहास, हाइबरनेशन फ़ाइल, पेज फ़ाइल, टेम्प फ़ाइलें, और अन्य सहित विभिन्न कैश का उपयोग करता है।
zh_hans: 安全删除模式的默认设置为关闭。 安全删除模式会增加相当多的处理时间，可能不需要。 此模式使用随机密码和随机初始化向量在删除之前加密原始项目和过程中使用的任何临时项目。 这些物品无法恢复。 Windows 10不会删除删除项目的内容。 它仅从数据库中删除项目名称并显示可用的占用空间。 由于Windows 10使用各种缓存（包括回收站，文件历史记录，休眠文件，页面文件，临时文件等），因此已删除项目的内容可能仍存在于设备上。

# UMP_ToggleVerbose_Msg
source: Default setting for verbose mode is on. Verbose mode displays detailed messages, suggestions, and tips at various locations. Turn verbose mode off to display abbreviated messages.
es: La configuración predeterminada para el modo detallado está encendida. El modo detallado muestra mensajes, sugerencias y consejos detallados en varias ubicaciones. Apague el modo detallado para mostrar mensajes abreviados.
fr: Le paramètre par défaut pour le mode verbeux est allumé. Le mode Verbose affiche des messages, des suggestions et des conseils détaillés à divers endroits. Éteignez le mode verbeux pour afficher les messages abrégés.
hi: वर्बोज़ मोड के लिए डिफ़ॉल्ट सेटिंग चालू है । वर्बोज़ मोड विस्तृत संदेश, सुझाव, और विभिन्न स्थानों पर सुझाव प्रदर्शित करता है । संक्षिप्त संदेश प्रदर्शित करने के लिए वर्बोज़ मोड को बंद करें ।
zh_hans: 详细模式的默认设置已启用。 详细模式显示各个位置的详细消息，建议和提示。 关闭详细模式以显示缩写消息。

# UMP_SP_Msg02
source: Enter password for locker folder.
es: Introduzca la contraseña para la carpeta del casillero.
fr: Entrez le mot de passe pour le dossier du casier.
hi: लॉकर फ़ोल्डर के लिए पासवर्ड दर्ज करें।
zh_hans: 输入储物柜文件夹的密码。

# HP_Success_Encrypt
source: Encrypted
es: Encriptado
fr: Chiffrée
hi: को गोपित
zh_hans: 加密

# HP_Error_Encrypt_ProcessFail
source: since encryption process failed
es: ya que el proceso de encriptación falló
fr: depuis que le processus de cryptage a échoué
hi: चूंकि एन्क्रिप्शन प्रक्रिया विफल रही है
zh_hans: 由于加密过程失败

# HP_Error_Encrypt_FileIsEncrypted
source: since already encrypted
es: porque ya está encriptado
fr: depuis déjà crypté
hi: चूंकि पहले ही एन्क्रिप्टेड है
zh_hans: 因为已经加密

# HP_Error_HierarchyOutside
source: since located outside of folder
es: ya que se encuentra fuera de la carpeta
fr: depuis situé à l'extérieur du dossier
hi: फ़ोल्डर के बाहर स्थित है
zh_hans: 由于位于文件夹外部

# UMP_Error_Picker_NothingPicked
source: Did not pick anything
es: No escogió nada
fr: N'a rien choisi
hi: कुछ भी नहीं चुना
zh_hans: 没有选择任何东西

# HP_Success_Decrypt
source: Decrypted
es: Descifrado
fr: Déchiffré
hi: डीक्रिप्ट
zh_hans: 解密

# HP_Error_Decrypt_ProcessFail
source: since decryption process failed
es: ya que el proceso de descifrado falló
fr: depuis que le processus de déchiffrement a échoué
hi: चूंकि डिक्रिप्शन प्रक्रिया विफल रही
zh_hans: 由于解密过程失败

# HP_Error_Decrypt_ItemExistDest
source: Could not decrypt {0} since {1} already contains item with name {2}
es: No se pudo descifrar {0} porque {1} ya contiene un elemento con el nombre {2}
fr: Impossible de déchiffrer {0} depuis {1} contient déjà l'élément avec le nom {2}
hi: {0} को डिक्रिप्ट नहीं कर सका क्योंकि {1} में पहले से नाम वाला आइटम है {2}
zh_hans: 无法解密 {0},因为 {1} 已包含名称为 {2} 的项目

# HP_Error_ParentFolder
source: since could not get read and write access to parent folder
es: ya que no se pudo obtener acceso de lectura y escritura a la carpeta principal
fr: puisque ne pouvait pas obtenir lire et écrire l'accès au dossier parent
hi: पढ़ने और पैरेंट फ़ोल्डर तक पहुँच लिखने के बाद से प्राप्त नहीं कर सका
zh_hans: 由于无法获取对父文件夹的读取和写入访问权限

# MP_UnhandledException_Msg
source: Unhandled exception occurred in method:
es: Excepción no controlada ocurrida en el método:
fr: L'exception non gérée s'est produite dans la méthode :
hi: विधि में अनचाहे अपवाद हुआ:
zh_hans: 方法中发生了未处理的异常:

# MP_Success_FolderCheck_NoArchive
source: Found or created folder
es: Carpeta encontrada o creada
fr: Dossier trouvé ou créé
hi: मिला या बनाया फ़ोल्डर
zh_hans: 找到或创建的文件夹

# MP_Error_FolderCheck_NoArchive
source: Could not find or create folder
es: No se pudo encontrar o crear una carpeta
fr: Impossible de trouver ou de créer un dossier
hi: फ़ोल्डर नहीं ढूंढ या बना सका
zh_hans: 找不到或创建文件夹

# HP_Error_Encrypt_ItemExistDest
source: Could not encrypt {0} since {1} already contains item with name {2}
es: No se pudo cifrar {0} porque {1} ya contiene elementos con el nombre {2}
fr: Impossible de chiffrer {0} depuis {1} contient déjà l'élément avec le nom {2}
hi: {0} को एंक्रिप्ट नहीं कर सका क्योंकि {1} के नाम {2} के साथ पहले से आइटम हैं
zh_hans: 无法加密 {0},因为 {1} 已包含名称为 {2} 的项目

# HP_ProcessingItem
source: Processing
es: Procesamiento
fr: Traitement
hi: प्रसंस्करण
zh_hans: 处理

# HP_PickFile_Delete
source: Select file to secure delete
es: Seleccione archivo para eliminar de forma segura
fr: Sélectionnez fichier à sécuriser supprimer
hi: सुरक्षित रूप से हटाने के लिए फ़ाइल चुनें
zh_hans: 选择要安全删除的文件

# HP_PickFolder_Delete
source: Select folder to secure delete
es: Seleccione carpeta para eliminar de forma segura
fr: Sélectionnez dossier à sécuriser supprimer
hi: सुरक्षित रूप से हटाने के लिए फ़ोल्डर चुनें
zh_hans: 选择要安全删除的文件夹

# HP_Success_FileExplorer
source: File explorer opened to {0}
es: Explorador de archivos abierto a {0}
fr: Explorateur de fichiers ouvert sur {0}
hi: फ़ाइल एक्सप्लोरर {0} को खोला गया
zh_hans: 文件资源管理器打开 {0}

# HP_Error_DeleteSecure
source: Could not secure delete
es: No se pudo asegurar borrar
fr: Impossible de sécuriser supprimer
hi: हटाएं सुरक्षित नहीं कर सका
zh_hans: 无法安全删除

# HP_Success_DeleteSecure
source: Secure deleted
es: Seguro eliminado
fr: Sécuriser supprimé
hi: सुरक्षित हटा दिया गया
zh_hans: 安全删除

# HP_ButDecryptFolder
source: Decrypt folder
es: Descifrar carpeta
fr: Décrypter le dossier
hi: डिक्रिप्ट फ़ोल्डर
zh_hans: 解密文件夹

# SF_Msg03
source: Windows 10 does not allow applications to access personal folders and files without permission. Create new folder or select existing folder to give application permission.
es: Windows 10 no permite que las aplicaciones accedan a carpetas y archivos personales sin permiso. Cree una nueva carpeta o seleccione la carpeta existente para dar permiso a la aplicación.
fr: Windows 10 n'autorise pas les applications à accéder à des dossiers et des fichiers personnels sans autorisation. Créez un nouveau dossier ou sélectionnez le dossier existant pour donner l'autorisation d'application.
hi: विंडोज 10 अनुप्रयोगों को अनुमति के बिना व्यक्तिगत फ़ोल्डर और फ़ाइलों तक पहुंचने की अनुमति नहीं देता है। एप्लिकेशन अनुमति देने के लिए नया फ़ोल्डर बनाएं या मौजूदा फ़ोल्डर का चयन करें।
zh_hans: Windows 10 不允许应用程序未经许可访问个人文件夹和文件。 创建新文件夹或选择现有文件夹以授予应用程序权限。

# SF_Msg05
source: Click following button to set location and name of locker folder.
es: Haga clic en el botón siguiente para establecer la ubicación y el nombre de la carpeta casillero.
fr: Cliquez sur le bouton suivant pour définir l'emplacement et le nom du dossier de casier.
hi: स्थान और लॉकर फ़ोल्डर का नाम सेट करने के लिए निम्न बटन क्लिक करें।
zh_hans: 单击以下按钮以设置储物柜文件夹的位置和名称。

# HP_ItemPathsNotProcessedPlural
source: items not processed
es: artículos no procesados
fr: articles non traités
hi: आइटम संसाधित नहीं किया गया
zh_hans: 未处理的文件夹或文件

# HP_ButCreateFolderNoArchive
source: Create AES folder
es: Crear la carpeta AES
fr: Créer un dossier AES
hi: एईएस फ़ोल्डर बनाएँ
zh_hans: 创建 AES 文件夹

# HP_PickFile_Decrypt
source: Select file to decrypt
es: Seleccionar archivo para descifrar
fr: Sélectionnez fichier à déchiffrer
hi: डीक्रिप्ट करने के लिए फ़ाइल का चयन करें
zh_hans: 选择要解密的文件

# SF_SampleFilename1
source: Instructions and advice
es: Instrucciones y consejos
fr: Instructions et conseils
hi: निर्देश और सलाह
zh_hans: 说明和建议

# HP_Error_Decrypt_FolderFilesFailed
source: Decrypted {0} files in {1}
es: Descifrado de {0} archivos en {1}
fr: Déchiffré {0} fichiers dans {1}
hi: {1} में डिक्रिप्ट {0} फ़ाइलें
zh_hans: 在 {1} 中解密了 {0} 个文件

# HP_Error_Encrypt_FolderFilesFailed
source: Encrypted {0} files in {1}
es: Encriptado {0} archivos en {1}
fr: Chiffré {0} fichiers dans {1}
hi: {1} में एन्क्रिप्टेड {0} फ़ाइलें
zh_hans: 在 {1} 中加密了 {0} 个文件

# SF_Success_Picker_Msg1
source: Folder selected was:
es: La carpeta seleccionada fue:
fr: Dossier sélectionné était:
hi: चयनित फ़ोल्डर था:
zh_hans: 选中的文件夹是:

# HP_Error_Encrypt_WrapperFolder
source: since could not create wrapper folder
es: ya que no se pudo crear la carpeta contenedora
fr: depuis ne pouvait pas créer dossier wrapper
hi: चूंकि रैपर फ़ोल्डर नहीं बना सका
zh_hans: 由于无法创建包装文件夹

# HP_Error_Encrypt_FlagFile
source: since could not create flag file
es: ya que no se pudo crear el archivo de pabellón
fr: depuis ne pouvait pas créer fichier drapeau
hi: चूंकि ध्वज फ़ाइल नहीं बना सका
zh_hans: 由于无法创建标志文件

# HP_Error_Decrypt_FileListFailed
source: Decrypted {0} but could not get list of files, decrypted content is in {1}
es: Descifrado {0} pero no se pudo obtener la lista de archivos, el contenido descifrado está en {1}
fr: Décrypté {0} mais n'a pas pu obtenir la liste des fichiers, le contenu décrypté est en {1}
hi: डिक्रिप्ट {0} लेकिन फ़ाइलों की सूची नहीं मिल सका, डिक्रिप्ट की गई सामग्री {1} में है
zh_hans: 解密的{0},但无法获取文件列表,解密的内容在{1}

# HP_Error_Decrypt_FileGetFailed
source: Decrypted {0} but could not get {1}, decrypted file was left in folder {2}
es: Descifrado {0} pero no pudo obtener {1}, descifrado archivo se dejó en la carpeta {2}
fr: Décrypté {0}, mais ne pouvait pas obtenir {1}, fichier décrypté a été laissé dans le dossier {2}
hi: डिक्रिप्ट {0} लेकिन {1} नहीं मिला, फ़ोल्डर में डिक्रिप्ट की गई फ़ाइल छोड़ी गई {2}
zh_hans: 解密的{0},但无法获取{1},解密文件留在文件夹{2}

# UMP_AB_Msg01
source: Application encrypts and decrypts folders and files using the Advanced Encryption Standard (AES). Data is stored independent of application and will not be deleted if application is uninstalled. Decrypted data is accessible by any application installed on device.
es: La aplicación encripta y descifra carpetas y archivos usando el Estándar de Encriptación Avanzado (Advanced Encryption Standard, AES). Los datos se almacenan independientemente de la aplicación y no se eliminarán si la aplicación se desinstala. La información descifrada es accesible por cualquier aplicación instalada en el dispositivo.
fr: L'application crypte et décrypte les dossiers et les fichiers à l'aide de la norme de chiffrement avancée (AES). Les données sont stockées indépendamment de l'application et ne seront pas supprimées si l'application n'est pas installée. Les données déchiffrées sont accessibles par toute application installée sur l'appareil.
hi: एप्लिकेशन उन्नत एन्क्रिप्शन मानक (एईएस) का उपयोग कर फ़ोल्डर और फ़ाइलों को एन्क्रिप्ट और डिक्रिप्ट करता है। डेटा को एप्लिकेशन से स्वतंत्र रूप से संग्रहीत किया जाता है और यदि एप्लिकेशन अनइंस्टॉल किया जाता है तो उसे हटाया नहीं जाएगा। डिवाइस पर स्थापित किसी भी एप्लिकेशन द्वारा डिक्रिप्ट किया गया डेटा पहुंच योग्य है।
zh_hans: 应用程序使用高级加密标准（AES）加密和解密文件夹和文件。 数据独立于应用程序存储，如果卸载应用程序，则不会删除。 安装在设备上的任何应用程序都可以访问解密数据。

# UMP_AB_Msg02
source: Encryption and decryption processes use one contiguous block of device memory. Maximum file size that can be processed is dependent on available device memory up to Windows 10 limit. Limit on 64-bit devices is four gibibyte. Limit on 32-bit devices is about two gibibyte. Programmer has twelve gibibyte computer and has processed four gibibyte files. Processes used all device memory and maximized use of SSD for extended time. You may not be able to decrypt files on less capable device. Workaround is limit file size to capability of minimum device used.
es: Los procesos de cifrado y descifrado utilizan un bloque contiguo de la memoria del dispositivo. El tamaño máximo de archivo que se puede procesar depende de la memoria del dispositivo disponible hasta el límite de Windows 10. El límite en dispositivos de 64 bits es cuatro gibibyte. El límite en dispositivos de 32 bits es aproximadamente dos gibibyte. El programador tiene doce computadoras gibibyte y ha procesado cuatro archivos gibibyte. Los procesos utilizaron toda la memoria del dispositivo y el uso máximo de SSD durante un tiempo prolongado. Es posible que no pueda descifrar archivos en un dispositivo con menos capacidad. La solución es limitar el tamaño del archivo a la capacidad del dispositivo mínimo utilizado.
fr: Les processus de chiffrement et de déchiffrement utilisent un bloc contigu de mémoire de périphérique. La taille de fichier maximale pouvant être traitée dépend de la mémoire disponible sur le périphérique, dans la limite de Windows 10. La limite sur les appareils 64 bits est de quatre gibibytes. La limite sur les périphériques 32 bits est d'environ deux gibibytes. Le programmeur a un ordinateur de douze gibioctets et a traité quatre fichiers de gibioctets. Les processus utilisaient toute la mémoire de l'appareil et maximisaient l'utilisation du disque SSD pendant une période prolongée. Vous ne pourrez peut-être pas décrypter des fichiers sur un périphérique moins performant. La solution consiste à limiter la taille du fichier à la capacité du périphérique minimal utilisé.
hi: एन्क्रिप्शन और डिक्रिप्शन प्रक्रियाएं डिवाइस मेमोरी के एक सन्निहित ब्लॉक का उपयोग करती हैं। अधिकतम फ़ाइल आकार जिसे संसाधित किया जा सकता है वह विंडोज 10 की सीमा तक उपलब्ध डिवाइस मेमोरी पर निर्भर है। 64-बिट उपकरणों पर सीमा चार gibibyte है। 32-बिट उपकरणों पर सीमा दो गिबिबाइट के बारे में है। प्रोग्रामर के पास बारह जिब्बीते कंप्यूटर होते हैं और उसने चार जिबीबेट फाइलों को संसाधित किया है। प्रक्रियाओं ने सभी डिवाइस मेमोरी का उपयोग किया और विस्तारित समय के लिए एसएसडी का अधिकतम उपयोग किया। आप कम सक्षम डिवाइस पर फ़ाइलों को डिक्रिप्ट करने में सक्षम नहीं हो सकते हैं। वर्कअराउंड उपयोग की जाने वाली न्यूनतम डिवाइस की क्षमता के लिए फ़ाइल का आकार सीमित है।
zh_hans: 加密和解密过程使用一个连续的设备内存块。 可以处理的最大文件大小取决于可用的设备内存，最高可达Windows 10限制。 对64位设备的限制是四个gibibyte。 32位设备的限制大约是两个gibibyte。 程序员有十二个gibibyte计算机，并处理了四个gibibyte文件。 进程使用所有设备内存并最大限度地使用SSD延长时间。 您可能无法在功能较弱的设备上解密文件。 解决方法是将文件大小限制为使用最小设备的能力。

# UMP_AB_Msg03
source: Application provides two methods to encrypt and decrypt data. Each method has advantages and disadvantages. Choose which method to use depending on data size and intended use.
es: La aplicación proporciona dos métodos para cifrar y descifrar datos. Cada método tiene ventajas y desventajas. Elija qué método usar según el tamaño de los datos y el uso previsto.
fr: Application fournit deux méthodes pour chiffrer et déchiffrer des données. Chaque méthode présente des avantages et des inconvénients. Choisissez la méthode à utiliser en fonction de la taille des données et de l'utilisation prévue.
hi: एप्लिकेशन डेटा एन्क्रिप्ट और डिक्रिप्ट करने के लिए दो विधियां प्रदान करता है। प्रत्येक विधि के फायदे और नुकसान होते हैं। डेटा आकार और इच्छित उपयोग के आधार पर उपयोग करने के लिए कौन सी विधि चुनें।
zh_hans: 应用程序提供了两种加密和解密数据的方法。 每种方法都有优点和缺点。 根据数据大小和预期用途选择使用哪种方法。

# UMP_AB_Msg04
source: First method places folder or file into an archive file and then encrypts archive file. Files in folder cannot be seen since they were placed into one file. Sharing content is simple since only one file needs to be exchanged. Limitation of this method is it creates one large file to encrypt. This method will exceed device memory limits more often than second method since encrypting one large file versus many smaller files. This method is always slower than second method.
es: El primer método coloca la carpeta o el archivo en un archivo comprimido y luego los cifra. Los archivos en la carpeta no se pueden ver ya que se colocaron en un archivo. Compartir contenido es simple ya que solo se necesita intercambiar un archivo. La limitación de este método es que crea un archivo grande para cifrar. Este método excederá los límites de memoria del dispositivo con más frecuencia que el segundo método, ya que encripta un archivo grande frente a muchos archivos más pequeños. Este método siempre es más lento que el segundo método.
fr: La première méthode place le dossier ou le fichier dans un fichier d’archive, puis chiffre le fichier d’archive. Les fichiers du dossier ne peuvent pas être vus car ils ont été placés dans un fichier. Le partage de contenu est simple car un seul fichier doit être échangé. La limite de cette méthode est qu'elle crée un fichier volumineux à chiffrer. Cette méthode dépasse les limites de mémoire de l'appareil plus souvent que la seconde méthode, car le cryptage d'un fichier volumineux est préférable à celui de nombreux fichiers plus petits. Cette méthode est toujours plus lente que la seconde méthode.
hi: पहली विधि फ़ोल्डर या फ़ाइल को एक संग्रह फ़ाइल में रखती है और फिर संग्रह फ़ाइल को एन्क्रिप्ट करता है। फ़ोल्डर में फ़ाइलों को देखा नहीं जा सकता क्योंकि उन्हें एक फ़ाइल में रखा गया था। सामग्री साझा करना सरल है क्योंकि केवल एक फ़ाइल को आदान-प्रदान की आवश्यकता है। इस विधि की सीमा यह एन्क्रिप्ट करने के लिए एक बड़ी फ़ाइल बनाता है। यह विधि कई छोटी फ़ाइलों के विरुद्ध एक बड़ी फ़ाइल एन्क्रिप्ट करने के बाद से दूसरी विधि की तुलना में डिवाइस मेमोरी सीमा से अधिक हो जाएगी। यह विधि हमेशा दूसरी विधि से धीमी है।
zh_hans: 第一种方法将文件夹或文件放入存档文件，然后加密存档文件。 文件夹中的文件因放入一个文件而无法看到。 共享内容很简单，因为只需要交换一个文件。 此方法的局限是它创建一个要加密的大文件。 自加密一个大文件与许多较小文件加密后，此方法将比第二种方法更频繁地超出设备内存限制。 此方法始终比第二种方法慢。
